In [1]:
import pandas as pd
import sqlalchemy as alch

from getpass import getpass

# Create a Python connection with SQL database

In [2]:
password = getpass("Introduce your sql password: ")

Introduce your sql password: ········

In [3]:
dbName = "sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

# Check the number of rentals for each customer for May

In [4]:
rentals_may = pd.read_sql_query("SELECT * FROM rentals_may", engine) 
rentals_may.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [8]:
rentals_may.groupby(["customer_id"]).count()

,rental_id,rental_date,inventory_id,return_date,staff_id,last_update
customer_id,,,,,,
1,2,2,2,2,2,2
2,1,1,1,1,1,1
3,2,2,2,2,2,2
5,3,3,3,3,3,3
6,3,3,3,3,3,3
...,...,...,...,...,...,...
594,4,4,4,4,4,4
595,1,1,1,1,1,1
596,6,6,6,6,6,6
597,2,2,2,2,2,2
599,1,1,1,1,1,1

In [ ]:
# I was trying to do it using python but I can't provide the same result as with the sql query:

In [10]:
query_may = "SELECT customer_id, COUNT(rental_id) AS num_rentals FROM rentals_may GROUP BY customer_id ORDER BY num_rentals DESC;"

rentals_may = pd.read_sql_query(query_may, engine) 
rentals_may

     customer_id  num_rentals
0            197            8
1            506            7
2            109            7
3            269            6
4            239            6
..           ...          ...
515          431            1
516          351            1
517           10            1
518          136            1
519           61            1

[520 rows x 2 columns]

# Check the number of rentals for each customer for June

In [11]:
query_june = "SELECT customer_id, COUNT(rental_id) AS num_rentals FROM rentals_june GROUP BY customer_id ORDER BY num_rentals DESC;"

rentals_june = pd.read_sql_query(query_june, engine) 
rentals_june

     customer_id  num_rentals
0             31           11
1            454           10
2            329            9
3            295            9
4            561            9
..           ...          ...
585          425            1
586          412            1
587          335            1
588           22            1
589          126            1

[590 rows x 2 columns]

# Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [14]:
may_june = rentals_may.merge(rentals_june, on= "customer_id", how="left")
may_june.head()

   customer_id  num_rentals_x  num_rentals_y
0          197              8            8.0
1          506              7            5.0
2          109              7            5.0
3          269              6            3.0
4          239              6            5.0

In [ ]:
# change name of the columns

In [18]:
may_june = may_june.rename(columns={"num_rentals_x":"rentals_may", "num_rentals_y":"rentals_june"})
may_june.head()

   customer_id  rentals_may  rentals_june
0          197            8           8.0
1          506            7           5.0
2          109            7           5.0
3          269            6           3.0
4          239            6           5.0

In [ ]:
# check if there are customers who rented in may and didn't rent in june

In [26]:
may_june.isna().sum()

customer_id     0
rentals_may     0
rentals_june    8
dtype: int64

In [31]:
# there are 8 clients who didn't rent in june. Replace this values with 0:

may_june = may_june.fillna(0)
may_june.isna().sum()

customer_id     0
rentals_may     0
rentals_june    0
dtype: int64

In [32]:
# create a new column to compare rentals in june vs rentals in may, and fill it with one value 
may_june["june_vs_may"] = "More in june"

In [33]:
# replace values of the june_vs_may column when they meet certain condition

may_june["june_vs_may"][may_june["rentals_may"]>may_june["rentals_june"]] = "More in may"
may_june["june_vs_may"][may_june["rentals_may"]==may_june["rentals_june"]] = "Same"

C:\Users\mboll\AppData\Local\Temp\ipykernel_15684\3083441628.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  may_june["june_vs_may"][may_june["rentals_may"]>may_june["rentals_june"]] = "More in may"
C:\Users\mboll\AppData\Local\Temp\ipykernel_15684\3083441628.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  may_june["june_vs_may"][may_june["rentals_may"]==may_june["rentals_june"]] = "Same"

In [35]:
may_june

     customer_id  rentals_may  rentals_june   june_vs_may
0            197            8           8.0          Same
1            506            7           5.0   More in may
2            109            7           5.0   More in may
3            269            6           3.0   More in may
4            239            6           5.0   More in may
..           ...          ...           ...           ...
515          431            1           7.0  More in june
516          351            1           3.0  More in june
517           10            1           5.0  More in june
518          136            1           1.0          Same
519           61            1           0.0   More in may

[520 rows x 4 columns]